# Heroes of Pymoli
## Analysis Report

### Preliminary Work

In [1]:
# Import libraries
import pandas as pd
import numpy as np

# Set data path
data_path_pymoli = "../HeroesOfPymoli/Resources/purchase_data.csv"

# Load data
df = pd.read_csv(data_path_pymoli)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

### Player Count

In [2]:
# Total Number of Players
len(df.SN.unique())

576

### Purchasing Analysis (Total)

In [3]:
# Number of Unique Items
len(df['Item ID'].unique())

183

In [4]:
# Average Purchase Price
df.Price.mean().round(2)

3.05

In [5]:
# Total Number of Purchases
len(df['Purchase ID'].unique())

780

In [6]:
# Total Revenue
df.Price.sum()

2379.77

### Gender Demographics

In [7]:
# Player Gender by Count
df.Gender.value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [8]:
# Player Gender by Percentage
(df.Gender.value_counts() / len(df.Gender)).round(2)

Male                     0.84
Female                   0.14
Other / Non-Disclosed    0.02
Name: Gender, dtype: float64

### Purchasing Analysis (Gender)

In [9]:
# Purchase Count
gender_group = df.groupby("Gender")
gender_group.Price.count()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [10]:
# Average Purchase Price
gender_group.Price.mean().round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [11]:
# Total Purchase Value
gender_group.Price.sum().round(2)

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [12]:
# Average Purchase Total per Person by Gender
(gender_group.Price.sum() / gender_group.Price.count()).round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

### Age Demographics

In [13]:
# Bin the groups by age range
age_bins = np.arange(10, 51, 5).tolist()
age_bins.insert(0, 0)
age_names = ['Under 10', '10 - 14', '15 - 19', '20 - 24', '25 - 29', 
             '30 - 34', '35 - 39', '40 - 44', '45 - 49']
df['age_range'] = pd.cut(df.Age, age_bins, labels=age_names, right=False)
age_grouped = df.groupby('age_range')

In [14]:
# Purchase Count by Age Range
age_grouped["Purchase ID"].count()

age_range
Under 10     23
10 - 14      28
15 - 19     136
20 - 24     365
25 - 29     101
30 - 34      73
35 - 39      41
40 - 44      12
45 - 49       1
Name: Purchase ID, dtype: int64

In [15]:
# Average Purchase Price by Age Range
age_grouped.Price.mean().round(2)

age_range
Under 10    3.35
10 - 14     2.96
15 - 19     3.04
20 - 24     3.05
25 - 29     2.90
30 - 34     2.93
35 - 39     3.60
40 - 44     3.04
45 - 49     1.70
Name: Price, dtype: float64

In [16]:
# Total Purchase Value by Age Range
age_grouped.Price.sum().round(2)

age_range
Under 10      77.13
10 - 14       82.78
15 - 19      412.89
20 - 24     1114.06
25 - 29      293.00
30 - 34      214.00
35 - 39      147.67
40 - 44       36.54
45 - 49        1.70
Name: Price, dtype: float64

In [17]:
# Average Purchase Total per Person by Age Range
(age_grouped.Price.sum() / age_grouped.Price.count()).round(2)

age_range
Under 10    3.35
10 - 14     2.96
15 - 19     3.04
20 - 24     3.05
25 - 29     2.90
30 - 34     2.93
35 - 39     3.60
40 - 44     3.04
45 - 49     1.70
Name: Price, dtype: float64

### Top Spenders

In [18]:
# Get Top 5 Spenders
spender_group = df.groupby('SN')
top_5_spenders = spender_group.Price.sum().sort_values(ascending=False).head(5).index.tolist()

# Subset data to include only top 5 spenders
top_5_spenders_df = df[df['SN'].isin(top_5_spenders)]

# Produce and print table
top_5_spenders_df.groupby('SN').Price.agg(Purchase_Count = 'count',
                                          Average_Purchase_Price = 'mean', 
                                          Total_Purchase_Value = 'sum'
                                         ).reset_index()

            SN  Purchase_Count  Average_Purchase_Price  Total_Purchase_Value
0   Chamjask73               3                4.610000                 13.83
1  Idastidru52               4                3.862500                 15.45
2       Iral74               4                3.405000                 13.62
3  Iskadarya95               3                4.366667                 13.10
4    Lisosia93               5                3.792000                 18.96

### Most Popular Items

In [21]:
# Top 5 most popular items
top_5_items_popularity = df['Item ID'].value_counts().head(5).index.tolist()

# Subset data to include only top 5 items
top_5_items_popularity_df = df[df['Item ID'].isin(top_5_items_popularity)]

# Produce and print table
top_5_items_popularity_df.groupby('Item ID').agg(Item_Name = ('Item Name', 'min'),
                                      Purchase_Count = ('Price', 'count'), 
                                      Item_Price = ('Price', 'mean'), 
                                      Total_Purchase_Value = ('Price', 'sum')
                                     ).reset_index()

,Item ID,Item_Name,Purchase_Count,Item_Price,Total_Purchase_Value
0,82,Nirvana,9,4.90,44.10
1,92,Final Critic,8,4.88,39.04
2,108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
3,145,Fiery Glass Crusader,9,4.58,41.22
4,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76

### Most Profitable Items

In [33]:
# Top 5 most profitable items
items_group = df.groupby('Item ID')
top_5_items_profit = items_group.Price.sum().sort_values(ascending=False).head(5).index.tolist()

# Subset data to include only top 5 spenders
top_5_items_profit_df = df[df['Item ID'].isin(top_5_items_profit)]

# Produce and print table
top_5_items_profit_df.groupby('Item ID').agg(Item_Name = ('Item Name', 'min'),
                                      Purchase_Count = ('Price', 'count'), 
                                      Item_Price = ('Price', 'mean'), 
                                      Total_Purchase_Value = ('Price', 'sum')
                                     ).reset_index()

,Item ID,Item_Name,Purchase_Count,Item_Price,Total_Purchase_Value
0,82,Nirvana,9,4.90,44.10
1,92,Final Critic,8,4.88,39.04
2,103,Singed Scalpel,8,4.35,34.80
3,145,Fiery Glass Crusader,9,4.58,41.22
4,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76